AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
#include "InterfaceManager.h"
#include "Config.h"
#include "Utils.h"
#include "Log.h"
#include "RoutingTable.h" // Need full definition now for RouteEntry
#include "ReticulumPacket.h" // For MAX_PACKET_SIZE
#include "AX25.h"
#include <WiFi.h>
#include <esp_wifi.h> // For esp_wifi_set_ps
#include <time.h>
#ifdef LORA_ENABLED
#include <SPI.h>
#endif
#ifdef HAM_MODEM_ENABLED
  #ifdef AUDIO_MODEM_ENABLED
    #include "AudioModem.h"
  #endif
  #ifdef WINLINK_ENABLED
    #include "Winlink.h"
  #endif
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#endif

#ifdef IPFS_ENABLED
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#endif

// ESP-NOW broadcast MAC address (FF:FF:FF:FF:FF:FF)
static const uint8_t espnow_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

static uint32_t espnow_crc32(const uint8_t *data, size_t len) {
    uint32_t crc = 0xFFFFFFFFu;
    for (size_t i = 0; i < len; ++i) {
        crc ^= static_cast<uint32_t>(data[i]);
        for (int b = 0; b < 8; ++b) {
            uint32_t mask = static_cast<uint32_t>(-(static_cast<int32_t>(crc & 1u)));
            crc = (crc >> 1) ^ (0xEDB88320u & mask);
        }
    }
    return ~crc;
}

// Define static instance pointer
InterfaceManager* InterfaceManager::_instance = nullptr;

InterfaceManager::InterfaceManager(PacketReceiverCallback receiver, RoutingTable& routingTable) :
    _packetReceiver(receiver),
    _routingTableRef(routingTable),
    _espNowInitialized(false),
    // Use lambda to capture 'this' for the member function callback
    _serialKissProcessor([this](const std::vector<uint8_t>& data, InterfaceType iface){ this->handleKissPacket(data, iface); })
#if BLUETOOTH_CLASSIC_AVAILABLE
    , _bluetoothKissProcessor([this](const std::vector<uint8_t>& data, InterfaceType iface){ this->handleKissPacket(data, iface); })
#endif
#ifdef LORA_ENABLED
    , _lora(nullptr), _loraInitialized(false)
#endif
#ifdef HAM_MODEM_ENABLED
    , _hamModemKissProcessor([this](const std::vector<uint8_t>& data, InterfaceType iface){ this->handleKissPacket(data, iface); })
    , _hamModemInitialized(false)
    #ifdef AUDIO_MODEM_ENABLED
    , _audioModem(nullptr)
    #endif
    #ifdef WINLINK_ENABLED
    , _winlink(nullptr)
    #endif
#endif
#ifdef IPFS_ENABLED
    , _ipfsInitialized(false)
#endif
{
    if (_instance != nullptr) {
         // This should not happen if InterfaceManager is instantiated only once by ReticulumNode
         DebugSerial.println("! FATAL: Multiple InterfaceManager instances detected!");
         return;
    }
    _instance = this; // Set the static instance pointer
}

void InterfaceManager::recordInterfaceRx(InterfaceType ifType, size_t bytes) {
    const size_t index = interfaceStatsIndex(ifType);
    if (index >= _interfaceStats.size()) {
        return;
    }

    InterfaceCounters &stats = _interfaceStats[index];
    stats.lastRxMs = millis();
    stats.rxPackets++;
    stats.rxBytes += static_cast<uint32_t>(bytes);
}

void InterfaceManager::recordInterfaceTx(InterfaceType ifType, size_t bytes) {
    const size_t index = interfaceStatsIndex(ifType);
    if (index >= _interfaceStats.size()) {
        return;
    }

    InterfaceCounters &stats = _interfaceStats[index];
    stats.lastTxMs = millis();
    stats.txPackets++;
    stats.txBytes += static_cast<uint32_t>(bytes);
}

bool InterfaceManager::isInterfaceSupported(InterfaceType ifType) const {
    switch (ifType) {
        case InterfaceType::SERIAL_PORT:
        case InterfaceType::ESP_NOW:
        case InterfaceType::WIFI_UDP:
            return true;
#if BLUETOOTH_CLASSIC_AVAILABLE
        case InterfaceType::BLUETOOTH:
            return true;
#else
        case InterfaceType::BLUETOOTH:
            return false;
#endif
#ifdef LORA_ENABLED
        case InterfaceType::LORA:
            return true;
#else
        case InterfaceType::LORA:
            return false;
#endif
#ifdef HAM_MODEM_ENABLED
        case InterfaceType::HAM_MODEM:
            return true;
#else
        case InterfaceType::HAM_MODEM:
            return false;
#endif
#ifdef IPFS_ENABLED
        case InterfaceType::IPFS:
            return true;
#else
        case InterfaceType::IPFS:
            return false;
#endif
        default:
            return false;
    }
}

InterfaceHealthSnapshot InterfaceManager::getInterfaceHealthSnapshot(InterfaceType ifType) const {
    InterfaceHealthSnapshot snapshot;
    snapshot.supported = isInterfaceSupported(ifType);
    snapshot.usable = snapshot.supported && isInterfaceUsableForRouting(ifType);

    const size_t index = interfaceStatsIndex(ifType);
    if (index >= _interfaceStats.size()) {
        return snapshot;
    }

    const InterfaceCounters &stats = _interfaceStats[index];
    snapshot.last_rx_uptime_ms = stats.lastRxMs;
    snapshot.last_tx_uptime_ms = stats.lastTxMs;
    snapshot.rx_packets = stats.rxPackets;
    snapshot.tx_packets = stats.txPackets;
    snapshot.rx_bytes = stats.rxBytes;
    snapshot.tx_bytes = stats.txBytes;
    return snapshot;
}

void InterfaceManager::setup() {
    setupSerial(); // Assumes Serial.begin() already called

    // Initialize Bluetooth first (if available)
#if BLUETOOTH_CLASSIC_AVAILABLE
    setupBluetooth();
#endif
    
    // Always start WiFi radio (needed for ESP-NOW even without AP connection)
    setupWiFi();
    setupESPNow();
    
#ifdef LORA_ENABLED
    setupLoRa();
#endif

#ifdef HAM_MODEM_ENABLED
    setupHAMModem();
#endif

#ifdef IPFS_ENABLED
    setupIPFS();
#endif
    
    DebugSerial.println("Interface Manager Setup Complete.");
}

void InterfaceManager::loop() {
    processEspNowReceiveQueue();
    cleanupExpiredEspNowAssemblies();
    processEspNowStoreForward();
#if defined(KISS_OVER_USB)
    flushPendingUsbKissFrames();
#endif

    // Periodic ESP-NOW diagnostic over KISS (every 10 seconds)
    unsigned long now = millis();
    if (now - _lastDiagMs >= 10000) {
        _lastDiagMs = now;
        sendEspNowDiagKiss();
    }

    // Process inputs from KISS interfaces
    processSerialInput();
#if BLUETOOTH_CLASSIC_AVAILABLE
    processBluetoothInput();
#endif

    // Process UDP input if WiFi is connected
    if (WiFi.status() == WL_CONNECTED) {
        processWiFiInput();
    }

