AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
// --- Input Processing ---
void InterfaceManager::processWiFiInput() {
    if (WiFi.status() != WL_CONNECTED) return;
    int packetSize = _udp.parsePacket();
    if (packetSize > 0) {
        if (packetSize > MAX_PACKET_SIZE) {
             DebugSerial.print("! WARN: Oversized UDP packet received ("); DebugSerial.print(packetSize); DebugSerial.println(" bytes), discarding.");
             while (_udp.available()) _udp.read();
             return;
        }

        // Use unique_ptr for automatic memory management
        std::unique_ptr<uint8_t[]> udpBuffer(new (std::nothrow) uint8_t[packetSize]);
        if (!udpBuffer) {
             LOG_ERROR("new failed for UDP buffer!");
             while (_udp.available()) _udp.read();
             return;
        }

        int len = _udp.read(udpBuffer.get(), packetSize);
        if (len > 0 && _packetReceiver) {
            recordInterfaceRx(InterfaceType::WIFI_UDP, static_cast<size_t>(len));
            _packetReceiver(udpBuffer.get(), len, InterfaceType::WIFI_UDP, nullptr, _udp.remoteIP(), _udp.remotePort());
        }
    }
}

void InterfaceManager::processSerialInput() {
     while (KissSerial.available()) {
        _serialKissProcessor.decodeByte(KissSerial.read(), InterfaceType::SERIAL_PORT);
    }
}

#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::processBluetoothInput() {
     while (_serialBT.available()) {
         _bluetoothKissProcessor.decodeByte(_serialBT.read(), InterfaceType::BLUETOOTH);
    }
}
#endif

// --- KISS Packet Handling ---
void InterfaceManager::handleKissPacket(const std::vector<uint8_t>& packetData, InterfaceType interface) {
     // Debug: Print raw received packet
     DebugSerial.print("[KISS] Received ");
     DebugSerial.print(packetData.size());
     DebugSerial.print(" bytes on interface ");
     DebugSerial.print(static_cast<int>(interface));
     DebugSerial.print(": ");
     for (size_t i = 0; i < min(packetData.size(), (size_t)20); i++) {
         if (packetData[i] < 0x10) DebugSerial.print("0");
         DebugSerial.print(packetData[i], HEX);
         DebugSerial.print(" ");
     }
     if (packetData.size() > 20) DebugSerial.print("...");
     DebugSerial.println();

     if (_packetReceiver) {
         recordInterfaceRx(interface, packetData.size());
         // Pass received packet up to ReticulumNode, indicate no specific sender MAC/IP/Port
         _packetReceiver(packetData.data(), packetData.size(), interface, nullptr, IPAddress(), 0);
     }
}


// --- Sending Logic ---
void InterfaceManager::sendPacket(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr, InterfaceType excludeInterface) {
    if (!packetBuffer || packetLen == 0) return;

    // Determine target interface(s) based on routing (or broadcast if unknown)
    RouteEntry* route = _routingTableRef.findRoute(
        destinationAddr,
        excludeInterface,
        [this](InterfaceType ifType) {
            return this->isInterfaceUsableForRouting(ifType);
        }
    );

    // Send via specific interface if route found, otherwise broadcast on relevant interfaces
    if (route) {
        if (route->interface != excludeInterface) {
             // Send only via the routed interface
             sendPacketVia(route->interface, packetBuffer, packetLen, destinationAddr);
        }
        // In TNC mode, also bridge to serial so the host sees all traffic,
        // unless the packet already came from serial or is routed to serial.
        if (excludeInterface != InterfaceType::SERIAL_PORT &&
            route->interface != InterfaceType::SERIAL_PORT) {
            sendPacketViaSerial(packetBuffer, packetLen);
        }
    } else {
        // No route, broadcast on primary interfaces (excluding source)
        // DebugSerial.print("Broadcasting packet (no route found) for dest: "); Utils::printBytes(destinationAddr, RNS_ADDRESS_SIZE, DebugSerial); DebugSerial.println(); // Verbose
        if (_espNowInitialized && excludeInterface != InterfaceType::ESP_NOW) {
            sendPacketViaEspNow(packetBuffer, packetLen, nullptr); // Broadcast = null dest for internal func
        }
        if (WiFi.status() == WL_CONNECTED && excludeInterface != InterfaceType::WIFI_UDP) {
             sendPacketViaWiFi(packetBuffer, packetLen, nullptr); // Broadcast = null dest for internal func
        }
#ifdef LORA_ENABLED
        if (_loraInitialized && excludeInterface != InterfaceType::LORA) {
            sendPacketViaLoRa(packetBuffer, packetLen, nullptr);
        }
#endif
        // Bridge packets to serial KISS (USB) so the host receives them
        if (excludeInterface != InterfaceType::SERIAL_PORT) { sendPacketViaSerial(packetBuffer, packetLen); }
#if BLUETOOTH_CLASSIC_AVAILABLE
        // if (_serialBT.connected() && excludeInterface != InterfaceType::BLUETOOTH) { sendPacketViaBluetooth(packetBuffer, packetLen); }
#endif
    }
}

void InterfaceManager::sendPacketVia(InterfaceType ifType, const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
     if (!packetBuffer || packetLen == 0) return;
     switch(ifType) {
        case InterfaceType::ESP_NOW:  if (_espNowInitialized) sendPacketViaEspNow(packetBuffer, packetLen, destinationAddr); break;
        case InterfaceType::WIFI_UDP: if (WiFi.status() == WL_CONNECTED) sendPacketViaWiFi(packetBuffer, packetLen, destinationAddr); break;
        case InterfaceType::SERIAL_PORT:   sendPacketViaSerial(packetBuffer, packetLen); break;
#if BLUETOOTH_CLASSIC_AVAILABLE
        case InterfaceType::BLUETOOTH:sendPacketViaBluetooth(packetBuffer, packetLen); break;
#endif
#ifdef LORA_ENABLED
        case InterfaceType::LORA: sendPacketViaLoRa(packetBuffer, packetLen, destinationAddr); break;
#endif
#ifdef HAM_MODEM_ENABLED
        case InterfaceType::HAM_MODEM: sendPacketViaHAMModem(packetBuffer, packetLen); break;
#endif
#ifdef IPFS_ENABLED
        case InterfaceType::IPFS: sendPacketViaIPFS(packetBuffer, packetLen, destinationAddr); break;
#endif
        default: DebugSerial.print("! WARN: sendPacketVia unsupported interface: "); DebugSerial.println(static_cast<int>(ifType)); break;
     }
}

void InterfaceManager::broadcastAnnounce(const uint8_t *packetBuffer, size_t packetLen, InterfaceType excludeInterface) {
     if (!packetBuffer || packetLen == 0) return;
     // Use nullptr destination for broadcast variants
     if (_espNowInitialized && excludeInterface != InterfaceType::ESP_NOW) {
         sendPacketViaEspNow(packetBuffer, packetLen, nullptr);
     }
     if (WiFi.status() == WL_CONNECTED && excludeInterface != InterfaceType::WIFI_UDP) {
         sendPacketViaWiFi(packetBuffer, packetLen, nullptr);
     }
#ifdef LORA_ENABLED
     if (_loraInitialized && excludeInterface != InterfaceType::LORA) {
         sendPacketViaLoRa(packetBuffer, packetLen, nullptr);
     }
#endif
#ifdef HAM_MODEM_ENABLED
     if (_hamModemInitialized && excludeInterface != InterfaceType::HAM_MODEM) {
         sendPacketViaHAMModem(packetBuffer, packetLen);
     }
#endif
     // Always send announces via serial KISS (USB/UART)
     if (excludeInterface != InterfaceType::SERIAL_PORT) sendPacketViaSerial(packetBuffer, packetLen);
}

// Internal send implementations
bool InterfaceManager::sendPacketViaEspNow(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
    return sendPacketViaEspNowInternal(packetBuffer, packetLen, destinationAddr, true);
}

