AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    EspNowQueuedPacket queued;
    queued.payload.assign(packetBuffer, packetBuffer + packetLen);
    queued.hasDestination = (destinationAddr != nullptr);
    if (queued.hasDestination) {
        memcpy(queued.destination.data(), destinationAddr, queued.destination.size());
    }
    queued.attempts = 0;
    queued.nextTryMs = millis() + ESPNOW_SF_RETRY_MS;
    _espNowStoreQueue.push_back(std::move(queued));
    return true;
#endif
}

void InterfaceManager::processEspNowStoreForward() {
#if ESPNOW_STORE_FORWARD_ENABLED
    if (!_espNowInitialized || _espNowStoreQueue.empty()) {
        return;
    }

    unsigned long now = millis();
    EspNowQueuedPacket &queued = _espNowStoreQueue.front();
    if ((long)(now - queued.nextTryMs) < 0) {
        return;
    }

    const uint8_t *dest = queued.hasDestination ? queued.destination.data() : nullptr;
    bool ok = sendPacketViaEspNowInternal(queued.payload.data(), queued.payload.size(), dest, false);
    if (ok) {
        _espNowStoreQueue.pop_front();
        return;
    }

    queued.attempts++;
    if (queued.attempts >= ESPNOW_SF_MAX_ATTEMPTS) {
        DebugSerial.println("! WARN: ESP-NOW store-forward max attempts reached, dropping packet");
        _espNowStoreQueue.pop_front();
        return;
    }
    queued.nextTryMs = now + ESPNOW_SF_RETRY_MS;
#endif
}

void InterfaceManager::processEspNowReceiveQueue() {
    if (!_espNowRxQueue) return;
    EspNowRxFrame frame;
    while (xQueueReceive(_espNowRxQueue, &frame, 0) == pdTRUE) {
        if (frame.length == 0 || frame.length > sizeof(frame.payload)) continue;
        DebugSerial.print("[ESP-NOW RX] "); DebugSerial.print(frame.length); DebugSerial.print("B from ");
        Utils::printBytes(frame.senderMac, sizeof(frame.senderMac), DebugSerial); DebugSerial.println();
        handleEspNowPayload(frame.senderMac, frame.payload, frame.length);
    }
}

#if METRICS_ENABLED && METRICS_UDP_ENABLED
void InterfaceManager::sendUdpMetrics(const String &json) {
    if (WiFi.status() != WL_CONNECTED) return;
    IPAddress bcast = WiFi.broadcastIP();
    if (!bcast || bcast == INADDR_NONE) return;
    _udp.beginPacket(bcast, METRICS_UDP_PORT);
    _udp.print(json);
    _udp.endPacket();
    LOG_DEBUG("UDP metrics sent to %s:%u", bcast.toString().c_str(), METRICS_UDP_PORT);
}
#endif

// KISS interface sends packaets over dedicated serial link
void InterfaceManager::sendPacketViaSerial(const uint8_t *packetBuffer, size_t packetLen) {
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
#if defined(KISS_OVER_USB)
    size_t written = KissSerial.write(kissEncoded.data(), kissEncoded.size());
    if (written == kissEncoded.size()) {
        recordInterfaceTx(InterfaceType::SERIAL_PORT, packetLen);
        return;
    }

    if (written > 0 && written < kissEncoded.size()) {
        kissEncoded.erase(kissEncoded.begin(), kissEncoded.begin() + written);
    }

    if (!Serial && written == 0) {
        if (_pendingUsbKissFrames.size() >= MAX_PENDING_USB_KISS_FRAMES) {
            _pendingUsbKissFrames.pop_front();
        }
        _pendingUsbKissFrames.push_back(std::move(kissEncoded));
        recordInterfaceTx(InterfaceType::SERIAL_PORT, packetLen);
        return;
    }

    if (_pendingUsbKissFrames.size() >= MAX_PENDING_USB_KISS_FRAMES) {
        _pendingUsbKissFrames.pop_front();
    }
    _pendingUsbKissFrames.push_back(std::move(kissEncoded));
    recordInterfaceTx(InterfaceType::SERIAL_PORT, packetLen);
    return;
#endif
    (void)KissSerial.write(kissEncoded.data(), kissEncoded.size()); // ignore return value
    recordInterfaceTx(InterfaceType::SERIAL_PORT, packetLen);
    // if(sent != kissEncoded.size()) { DebugSerial.println("! WARN: Serial write incomplete"); } // Optional check
}

#if defined(KISS_OVER_USB)
void InterfaceManager::flushPendingUsbKissFrames() {
    if (_pendingUsbKissFrames.empty()) {
        return;
    }

    while (!_pendingUsbKissFrames.empty()) {
        std::vector<uint8_t> &frame = _pendingUsbKissFrames.front();
        size_t written = KissSerial.write(frame.data(), frame.size());
        if (written == 0) {
            break; // TX buffer full, retry next loop
        }
        if (written < frame.size()) {
            // Partial write: remove the bytes already sent so we
            // resume cleanly on the next flush without duplicating data.
            frame.erase(frame.begin(), frame.begin() + written);
            break;
        }
        _pendingUsbKissFrames.pop_front();
    }
}
#endif

bool InterfaceManager::isInterfaceUsableForRouting(InterfaceType ifType) const {
    switch (ifType) {
        case InterfaceType::ESP_NOW:
            return _espNowInitialized;
        case InterfaceType::WIFI_UDP:
            return WiFi.status() == WL_CONNECTED;
        case InterfaceType::SERIAL_PORT:
#if defined(KISS_OVER_USB)
            return static_cast<bool>(Serial);
#else
            return true;
#endif
#if BLUETOOTH_CLASSIC_AVAILABLE
        case InterfaceType::BLUETOOTH:
            return _serialBT.connected();
#endif
#ifdef LORA_ENABLED
        case InterfaceType::LORA:
            return _loraInitialized;
#endif
#ifdef HAM_MODEM_ENABLED
        case InterfaceType::HAM_MODEM:
            return _hamModemInitialized;
#endif
#ifdef IPFS_ENABLED
        case InterfaceType::IPFS:
            return _ipfsInitialized;
#endif
        default:
            return false;
    }
}

#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::sendPacketViaBluetooth(const uint8_t *packetBuffer, size_t packetLen) {
    if (!_serialBT.connected()) return;
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
    size_t sent = _serialBT.write(kissEncoded.data(), kissEncoded.size());
    if (sent > 0) {
        recordInterfaceTx(InterfaceType::BLUETOOTH, packetLen);
    }
     // if(sent != kissEncoded.size()) { DebugSerial.println("! WARN: Bluetooth write incomplete"); } // Optional check
}
#endif

// --- ESP-NOW Peer Management ---
void InterfaceManager::enableEspNow() {
    if (_espNowInitialized) {
        DebugSerial.println("IF: ESP-NOW already enabled.");
        return;
    }
    // Ensure WiFi radio is in STA mode
    if (WiFi.getMode() == WIFI_OFF) {
        WiFi.mode(WIFI_STA);
        esp_wifi_set_ps(WIFI_PS_NONE);
    }
    setupESPNow();
}

void InterfaceManager::disableEspNow() {
    if (!_espNowInitialized) {
        DebugSerial.println("IF: ESP-NOW already disabled.");
        return;
    }
    esp_now_deinit();
    if (_espNowRxQueue) xQueueReset(_espNowRxQueue);
    _espNowPeers.clear();
    _espNowInitialized = false;
    DebugSerial.println("IF: ESP-NOW disabled.");
}

bool InterfaceManager::addEspNowPeer(const uint8_t* mac_addr) {
    if (!mac_addr || !_espNowInitialized) return false;
    if (checkEspNowPeer(mac_addr)) {
        // ensure our list also contains it
        std::array<uint8_t,6> arr;
        memcpy(arr.data(), mac_addr, 6);
        if (std::find(_espNowPeers.begin(), _espNowPeers.end(), arr) == _espNowPeers.end()) {
            _espNowPeers.push_back(arr);
        }
        return true; // Already exists at driver level
    }

    esp_now_peer_info_t peerInfo = {}; // Initialize all fields to 0/false/etc.
    memcpy(peerInfo.peer_addr, mac_addr, 6);
    // peerInfo.channel = 0; // Use current channel by default
    peerInfo.encrypt = false; // ESP-NOW link-layer encryption requires provisioned shared peer keys.
    // Try adding peer. On some IDF/Arduino builds the driver requires the ifidx
    // (station vs softAP) to be set. Try without ifidx first, then retry with
    // WIFI_IF_STA if the first attempt fails.
    esp_err_t add_result = esp_now_add_peer(&peerInfo);
    if (add_result != ESP_OK) {
         DebugSerial.print("! WARN: esp_now_add_peer() initial attempt failed for "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(add_result));
         // Retry with explicit interface index
         peerInfo.ifidx = WIFI_IF_STA;
         add_result = esp_now_add_peer(&peerInfo);
         if (add_result != ESP_OK) {
             DebugSerial.print("! ERROR: Failed to add ESP-NOW peer after retry "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(add_result));
             return false;
         } else {
             DebugSerial.println("IF: esp_now_add_peer succeeded on retry with WIFI_IF_STA");
         }
    }
    DebugSerial.print("IF: Added ESP-NOW peer: "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
    // record in our local list
    {
        std::array<uint8_t,6> arr;
        memcpy(arr.data(), mac_addr, 6);
        _espNowPeers.push_back(arr);
    }
    return true;
}

bool InterfaceManager::removeEspNowPeer(const uint8_t* mac_addr) {
     if (!mac_addr || !_espNowInitialized) return false;
     if (!checkEspNowPeer(mac_addr)) return false; // Not found

     esp_err_t del_result = esp_now_del_peer(mac_addr);
     if (del_result != ESP_OK) {
         DebugSerial.print("! WARN: Failed to delete ESP-NOW peer "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(del_result));
         return false;
     }
     DebugSerial.print("IF: Removed ESP-NOW peer: "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
     // remove from our vector as well
     std::array<uint8_t,6> arr;
     memcpy(arr.data(), mac_addr, 6);
     auto it = std::find(_espNowPeers.begin(), _espNowPeers.end(), arr);
     if (it != _espNowPeers.end()) _espNowPeers.erase(it);
     return true;
}

bool InterfaceManager::checkEspNowPeer(const uint8_t* mac_addr) {
    if (!mac_addr || !_espNowInitialized) return false;
    // esp_now_is_peer_exist() is deprecated/removed in later IDF versions.
    // Use esp_now_get_peer() and check result.
    esp_now_peer_info_t peer_info;
    return (esp_now_get_peer(mac_addr, &peer_info) == ESP_OK);
    // return esp_now_is_peer_exist(mac_addr); // Older IDF versions
}

bool InterfaceManager::parseEspNowFragment(const uint8_t *data, int len, uint16_t &messageId, uint8_t &chunkIndex, uint8_t &totalChunks, bool &hasCrc, uint32_t &expectedCrc, const uint8_t* &chunkData, size_t &chunkLen) const {
    if (!data || len <= 0) return false;
    if (len < static_cast<int>(ESPNOW_FRAG_HEADER_LEN)) return false;
    if (data[0] != ESPNOW_FRAG_MAGIC0 || data[1] != ESPNOW_FRAG_MAGIC1 || data[2] != ESPNOW_FRAG_VERSION) return false;

    if ((data[3] & 0xFE) != 0) return false;
    hasCrc = (data[3] & 0x01) != 0;
    messageId = (static_cast<uint16_t>(data[4]) << 8) | static_cast<uint16_t>(data[5]);
    chunkIndex = data[6];
    totalChunks = data[7];
    if (totalChunks == 0 || totalChunks > ESPNOW_MAX_FRAGMENT_CHUNKS || chunkIndex >= totalChunks) return false;

    expectedCrc = (static_cast<uint32_t>(data[8]) << 24)
                | (static_cast<uint32_t>(data[9]) << 16)
                | (static_cast<uint32_t>(data[10]) << 8)
                | static_cast<uint32_t>(data[11]);

    chunkData = data + ESPNOW_FRAG_HEADER_LEN;
    chunkLen = static_cast<size_t>(len) - ESPNOW_FRAG_HEADER_LEN;
    if (chunkLen == 0 || chunkLen > ESPNOW_FRAG_CHUNK_DATA_LEN) return false;
    if (chunkIndex + 1 < totalChunks && chunkLen != ESPNOW_FRAG_CHUNK_DATA_LEN) return false;
    return true;
}

InterfaceManager::EspNowRxAssembly* InterfaceManager::getEspNowAssemblySlot(const uint8_t *senderMac, uint16_t messageId, uint8_t totalChunks) {
    if (!senderMac || totalChunks == 0) return nullptr;

    for (auto &slot : _espNowRxAssemblies) {
        if (slot.active && slot.messageId == messageId && slot.totalChunks == totalChunks && memcmp(slot.senderMac.data(), senderMac, 6) == 0) {
            return &slot;
        }
    }

    for (auto &slot : _espNowRxAssemblies) {
        if (!slot.active) {
            slot.active = true;
            memcpy(slot.senderMac.data(), senderMac, 6);
            slot.messageId = messageId;
            slot.totalChunks = totalChunks;
            slot.hasCrc = false;
            slot.expectedCrc = 0;
            slot.lastUpdateMs = millis();
            slot.chunks.assign(totalChunks, std::vector<uint8_t>());
            slot.receivedChunk.assign(totalChunks, 0);
            slot.receivedCount = 0;
            return &slot;
        }
    }

