AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    char buf[160];
    int n = snprintf(buf, sizeof(buf),
        "ESPNOW ch=%u init=%d tx_ok=%lu tx_fail=%lu rx=%lu rx_drop=%lu peers=%u pwr=%d mac=%s",
        ch, _espNowInitialized ? 1 : 0,
        (unsigned long)espNowTxOk, (unsigned long)espNowTxFail,
        (unsigned long)espNowRxCount,
        (unsigned long)espNowRxDropped,
        (unsigned)_espNowPeers.size(), (int)txPwr,
        WiFi.macAddress().c_str());
    if (n <= 0) return;
    if (n >= static_cast<int>(sizeof(buf))) n = sizeof(buf) - 1;

    // Build KISS frame: FEND + cmd(0x06) + payload + FEND
    std::vector<uint8_t> frame;
    frame.reserve(n + 10);
    frame.push_back(KISS_FEND);
    frame.push_back(0x06); // KISS SetHardware / diagnostic
    for (int i = 0; i < n; ++i) {
        uint8_t b = static_cast<uint8_t>(buf[i]);
        if (b == KISS_FEND) { frame.push_back(KISS_FESC); frame.push_back(KISS_TFEND); }
        else if (b == KISS_FESC) { frame.push_back(KISS_FESC); frame.push_back(KISS_TFESC); }
        else frame.push_back(b);
    }
    frame.push_back(KISS_FEND);

#if defined(KISS_OVER_USB)
    size_t written = KissSerial.write(frame.data(), frame.size());
    if (written == 0) {
        return;
    }
#else
    KissSerial.write(frame.data(), frame.size());
#endif
}

#ifdef LORA_ENABLED
// --- LoRa Implementation ---
void InterfaceManager::setupLoRa() {
    DebugSerial.println("IF: Initializing LoRa...");
    
    // Initialize SPI for LoRa
    // Use VSPI (SPI3) for ESP32, HSPI for other variants
    #if defined(CONFIG_IDF_TARGET_ESP32)
        SPIClass* spi = new SPIClass(VSPI);
    #else
        SPIClass* spi = new SPIClass(HSPI);
    #endif
    
    spi->begin(LORA_SPI_SCK, LORA_SPI_MISO, LORA_SPI_MOSI, LORA_CS_PIN);
    
    // Create LoRa module instance with SPI settings
    Module* loraModule = new Module(LORA_CS_PIN, LORA_DIO0_PIN, LORA_RST_PIN, RADIOLIB_NC, *spi, SPISettings(2000000, MSBFIRST, SPI_MODE0));
    
    // Create SX1278 instance
    _lora = new SX1278(loraModule);
    
    // Initialize LoRa with configuration
    int state = _lora->begin(LORA_FREQUENCY, LORA_BANDWIDTH, LORA_SPREADING_FACTOR, LORA_CODING_RATE, LORA_SYNC_WORD, LORA_OUTPUT_POWER, LORA_PREAMBLE_LENGTH, LORA_GAIN);
    
    if (state == RADIOLIB_ERR_NONE) {
        // Put radio into continuous RX mode so processLoRaInput() can receive
        int rxState = _lora->startReceive();
        if (rxState != RADIOLIB_ERR_NONE) {
            DebugSerial.print("! WARN: LoRa startReceive failed: "); DebugSerial.println(rxState);
        }
        _loraInitialized = true;
        DebugSerial.println("IF: LoRa initialized successfully.");
        DebugSerial.print("IF: Frequency: "); DebugSerial.print(LORA_FREQUENCY); DebugSerial.println(" MHz");
        DebugSerial.print("IF: Bandwidth: "); DebugSerial.print(LORA_BANDWIDTH); DebugSerial.println(" kHz");
        DebugSerial.print("IF: Spreading Factor: "); DebugSerial.println(LORA_SPREADING_FACTOR);
    } else {
        _loraInitialized = false;
        DebugSerial.print("! ERROR: LoRa initialization failed with code: ");
        DebugSerial.println(state);
        delete _lora;
        _lora = nullptr;
    }
}

void InterfaceManager::processLoRaInput() {
    if (!_loraInitialized || !_lora) return;
    
    // Check if data is available
    if (_lora->available()) {
        // Determine packet size (LoRa can receive variable length packets)
        size_t packetSize = _lora->getPacketLength();
        if (packetSize == 0 || packetSize > MAX_PACKET_SIZE) {
            DebugSerial.print("! WARN: Invalid LoRa packet size: ");
            DebugSerial.println(packetSize);
            _lora->clearIrqFlags(_lora->getIrqFlags());
            return;
        }
        
        // Allocate buffer for received packet
        std::unique_ptr<uint8_t[]> loraBuffer(new (std::nothrow) uint8_t[packetSize]);
        if (!loraBuffer) {
            DebugSerial.println("! ERROR: Failed to allocate LoRa receive buffer!");
            _lora->clearIrqFlags(_lora->getIrqFlags());
            return;
        }
        
        // Read packet data
        int state = _lora->readData(loraBuffer.get(), packetSize);
        if (state == RADIOLIB_ERR_NONE) {
            // Pass received packet to packet receiver callback
            // LoRa doesn't have MAC addresses, so use nullptr
            if (_packetReceiver) {
                recordInterfaceRx(InterfaceType::LORA, packetSize);
                _packetReceiver(loraBuffer.get(), packetSize, InterfaceType::LORA, nullptr, IPAddress(), 0);
            }
        } else {
            DebugSerial.print("! WARN: LoRa read failed with code: ");
            DebugSerial.println(state);
        }
        
        // Clear IRQ flags to prepare for next packet
        _lora->clearIrqFlags(_lora->getIrqFlags());
    }
}

void InterfaceManager::sendPacketViaLoRa(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
    if (!_loraInitialized || !_lora || !packetBuffer || packetLen == 0) return;
    
    // LoRa is broadcast by nature, so destinationAddr is not used here.
    
    // Send packet
    int state = _lora->transmit(packetBuffer, packetLen);
    if (state == RADIOLIB_ERR_NONE) {
        // Success - packet sent
        recordInterfaceTx(InterfaceType::LORA, packetLen);
        // DebugSerial.println("IF: LoRa packet sent successfully.");
    } else {
        DebugSerial.print("! ERROR: LoRa transmit failed with code: ");
        DebugSerial.println(state);
    }
    // Re-enter RX mode after transmit (transmit leaves radio in standby)
    _lora->startReceive();
}
#endif

#ifdef HAM_MODEM_ENABLED
// --- HAM Modem Implementation ---
void InterfaceManager::setupHAMModem() {
    DebugSerial.println("IF: Initializing HAM Modem...");
    
    // Initialize serial port for HAM modem (typically connected to TNC)
    HAM_MODEM_SERIAL.begin(HAM_MODEM_BAUD, SERIAL_8N1, HAM_MODEM_RX_PIN, HAM_MODEM_TX_PIN);

#ifdef AUDIO_MODEM_ENABLED
    if (_audioModem == nullptr) {
        _audioModem = new AudioModem(AudioModem::ModemType::BELL_202);
        if (_audioModem && !_audioModem->begin(HAM_MODEM_RX_PIN, HAM_MODEM_TX_PIN, AUDIO_MODEM_SAMPLE_RATE)) {
            DebugSerial.println("! WARN: Audio modem initialization failed.");
        } else {
            DebugSerial.println("IF: Audio modem initialized.");
        }
    }
#endif

#ifdef WINLINK_ENABLED
    if (_winlink == nullptr) {
        _winlink = new Winlink();
        if (!_winlink->begin(APRS_CALLSIGN, WINLINK_PASSWORD)) {
            DebugSerial.println("! WARN: Winlink initialization failed.");
        } else {
            _winlink->setRawSender(InterfaceManager::winlinkSendRaw, this);
            DebugSerial.println("IF: Winlink initialized.");
        }
    }
#endif

#if defined(AUDIO_MODEM_ENABLED)
    // Spawn audio capture task if not running
    if (_audioCaptureTaskHandle == nullptr && _audioModem) {
        BaseType_t r = xTaskCreatePinnedToCore(
            audioCaptureTask,
            "audio_cap",
            4096,
            this,
            1,
            &_audioCaptureTaskHandle,
            0);
        if (r != pdPASS) {
            DebugSerial.println("! WARN: Failed to start audio capture task");
            _audioCaptureTaskHandle = nullptr;
        } else {
            DebugSerial.println("IF: Audio capture task started.");
        }
    }
#endif
    
    // Most HAM TNCs use KISS protocol, which we already support
    // The KISS processor will handle incoming packets
    _hamModemInitialized = true;
    
    DebugSerial.println("IF: HAM Modem initialized (KISS protocol).");
    DebugSerial.print("IF: Baud rate: "); DebugSerial.println(HAM_MODEM_BAUD);
    DebugSerial.print("IF: Callsign: "); DebugSerial.println(APRS_CALLSIGN);
}

void InterfaceManager::processHAMModemInput() {
    if (!_hamModemInitialized) return;
    
